Autodesk.Revit.DB.ProjectParameterAccess.MarkCompanyInfo(System.String,System.String)
Records the given friendly name for the given company account identifier. The name is not written to the Revit
document until the next call to CommitUpdates() on this object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ProjectParameterAccess.MarkUploadedParameterIdentifier(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ForgeTypeId)
Records the given ForgeTypeId as the identifier of a new schema uploaded to Forge to represent the local
parameter with the given ElementId. The local parameter's ForgeTypeId identifier is not changed until the next
call to CommitUpdates() on this object.
After calling this method, GetForgeParametersInActiveModel() may return different results, reflecting that
local parameters have been updated with their new Forge parameter identifiers.
parameterId:
Local parameter for which to record a new identifier.
newSchemaIdentifier:
Identifier of a schema uploaded to represent the local parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ProjectParameterAccess.GetLocalParameterData
Returns a list of JSON strings serializing objects detailing local (non-Forge) project shared parameters
present in the active model. Each serialized JSON object in the array has these properties:
- bindings: Object specifying the parameter's category and group bindings.
- id: ElementId integer identifying the shared parameter element in the Revit project.
- guid: The GUID identifying the shared parameter in the Revit project.
- schema: Parameter definition object.
Returns:
Array of JSON-serialized objects detailing local (non-Forge) project shared parameters in the active model.

Autodesk.Revit.DB.ProjectParameterAccess.GetForgeParametersInActiveModel
Returns a list of the identifiers of Forge parameters present in the active model. Local parameters that do not
correspond to any definition on Forge are omitted from this list.
Identifiers are provided here as raw strings instead of ForgeTypeId to enable direct serialization to JSON for
use in a JavaScript web app.
Returns:
The identifiers of Forge parameters in the active model.

Autodesk.Revit.DB.ProjectParameterAccess.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ProjectParameterAccess
Provides a view of the parameters loaded in a given Revit project and supports ForgeTypeId identifier migration
for parameters uploaded to Forge.